def dva(x):
    bykv = {'АВЕИНОРСТ': 1, 'ДКЛМПУ': 2, 'БГЁЬЯ': 3, 'ЙЫ': 4, 'ЖЗХЦЧ': 5, 'ШЭЮ': 8, 'ФЩЪ': 10}
    for key in bykv:
        if x in key:
            return bykv.get(key)
print(sum(map(dva, input("Введите слово  "))))
def zadacha1():
    spisok = {'Россия': 'Москва', 'Польша': 'Варшава', 'Германия': 'Берлин', 'Франция': 'Париж', 'Италия': 'Рим', 'Беларусь': 'Минск', 'Чехия': 'Прага', 'Дания': 'Копенгаген', 'Аргентина': 'Буэнос-Айрес', 'США': 'Вашингтон', 'Канада': 'Оттава', 'Бразилия': 'Бразилиа', 'Колумбия': 'Богота'}
    print (spisok)
    strana = input("Введите страну  ")
    print(spisok.get(strana))
    sort = dict(sorted(spisok.items()))
    print(sort)
zadacha1()
def z3():
    a = { "иванов":["китайский", "английский", "русский"],
          "сидоров" : ["русский", "французский"],
          "фролов": ["финский", "русский", "китайский"],
          "маслов": ["русский"],
          "федоров" : ["китайский","русский"]}
    c = ["китайский", "английский", "русский", "финский", "французский"]
    print(sorted(c))
    for key, value in a.items():
        if "китайский" in value:
            print(key)
z3()